Revit 2027 API
BuiltInFailures.RegenFailures.CircularDependencyResolved Property
 There was a circular chain of references among the highlighted elements that was attempted to resolve. User-visible text will depend on original error returned by offending element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircularDependencyResolved { get; }
Public Shared ReadOnly Property CircularDependencyResolved As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircularDependencyResolved {
	FailureDefinitionId^ get ();
}
static member CircularDependencyResolved : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace